app/Controllers/Categorias.php

    public function index()
    {
        //chama uma view que exibe todas as categorias
        $categoriaModel = new \App\Models\CategoriaModel();
        $data['categorias'] = $categoriaModel->find();
---
SELECT *
FROM `categoria`

    public function editar($id)
    {
        $data['titulo'] = 'Editar categoria' . $id;
        $data['acao'] = 'editar';
        $data['msg'] = '';
        $categoriaModel = new \App\Models\CategoriaModel();
        $categoria = $categoriaModel->find($id);
---
SELECT *
FROM `categoria`
WHERE `categoria`.`id` = '1'