app/Controllers/Produtos.php

SELECT *
FROM `categoria`
INSERT INTO `produtos` (`nomeproduto`, `valor`, `id_categoria`) VALUES ('', '', '1')
---
    public function inserir()
    {
        $data['msg'] = '';
        $data['titulo'] = 'Inserir novo produto';
        $data['acao'] = 'inserir';
        $data['erros'] = '';

        $categoriaModel = new \App\Models\CategoriaModel();
        $listaCategorias = $categoriaModel->findAll();

        helper('form');
        $arrayCategorias = [];
        foreach($listaCategorias as $categoria){
            $arrayCategorias[$categoria->id] = $categoria->nomecategoria;
        }
        $data['comboCategorias'] = form_dropdown('categoria_id', $arrayCategorias);

        if($this ->request->getMethod() === 'post')
        {
            $produtoModel = new \App\Models\ProdutoModel();
            $produtoModel -> set('nomeproduto', $this->request->getPost('nomeproduto'));
            $produtoModel -> set('valor', $this->request->getPost('valor'));
            $produtoModel -> set('id_categoria', $this->request->getPost('categoria_id'));

            if($produtoModel ->insert())